//////////////////////////////////////////////////////////////////////////
///    COPYRIGHT NOTICE
///    Copyright (c) 2010, 浙江共创技术有限公司
///    All rights reserved.
///
/// @file	time.h
/// @brief	定时器头文件
///
///
///
/// @version	1.0     
/// @author		xul	<gxuliang@gmail.com>          
/// @date		2010-04-11                 
///
///
///     修订说明：最初版本
//////////////////////////////////////////////////////////////////////////

#ifndef _TIME_H_
#define _TIME_H_



#ifndef _TIME_C_
#define GLOBLE_TIME extern
#else
#define GLOBLE_TIME
#endif


GLOBLE_TIME uint8		flag_1000ms;

//////////////////////////////////////////////////////////////////////////
///
///     微秒忙等待函数
///     @param		x 微秒数
///		@author		xul	<gxuliang@gmail.com>          
///		@date		2010-04-11                 
//////////////////////////////////////////////////////////////////////////
inline void udelay(unsigned long x) { unsigned long i; for(i = 0; i < x; i++) __delay_cycles(8); }
//////////////////////////////////////////////////////////////////////////
///
///     10微秒忙等待函数
///     @param		x 10微秒数
///		@author		xul	<gxuliang@gmail.com>          
///		@date		2010-04-11                 
//////////////////////////////////////////////////////////////////////////
inline void _100udelay(unsigned long x) { unsigned long i; for(i = 0; i < x; i++) __delay_cycles(800); }
//////////////////////////////////////////////////////////////////////////
///
///     毫秒忙等待函数
///     @param		x 毫秒数
///		@author		xul	<gxuliang@gmail.com>          
///		@date		2010-04-11                 
//////////////////////////////////////////////////////////////////////////
inline void mdelay(unsigned long x) { unsigned long i; for(i = 0; i < x; i++) __delay_cycles(8000); }
//////////////////////////////////////////////////////////////////////////
///
///     定时器0初始化，10ms中断一次
///		@author		xul	<gxuliang@gmail.com>          
///		@date		2010-04-11                 
//////////////////////////////////////////////////////////////////////////
GLOBLE_TIME void timer0_init(void);



#endif




/*=============================================================================
==============================END OF THE FILE==================================
==============================================================================*/
